# RemoveElectricalLoadArea Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaBasedLoadData..::..RemoveElectricalLoadArea Method
AreaBasedLoadData Class See Also
---
Removes electrical load area from the area based load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public void RemoveElectricalLoadArea(
	ElementId electricalLoadAreaId
)
```

Visual Basic
---
```text
Public Sub RemoveElectricalLoadArea ( _
	electricalLoadAreaId As ElementId _
)
```

Visual C++
---
```text
public:
void RemoveElectricalLoadArea(
	ElementId^ electricalLoadAreaId
)
```

# ### Parameters
electricalLoadAreaId
    Type: Autodesk.Revit.DB..::..ElementId The electrical load area id to remove.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace